import { TimePeriod } from "./types";

export const historicPeriods: TimePeriod[] = [
  {
    label: "Наука",
    events: [
      {
        date: "2001",
        description:
          "Расшифрован полный геном человека в рамках проекта «Геном человека».",
      },
      {
        date: "2004",
        description: "Открытие карликовой планеты Хаумеа в поясе Койпера.",
      },
      {
        date: "2012",
        description: "В ЦЕРНе объявили об открытии бозона Хиггса.",
      },
      {
        date: "2019",
        description: "Получено первое изображение чёрной дыры в галактике M87.",
      },
      {
        date: "2021",
        description:
          "Создан самый точный атомный часы в мире с отклонением менее 1 секунды за 15 миллиардов лет.",
      },
      {
        date: "2023",
        description:
          "Японский аппарат Hayabusa2 доставил образцы астероида Рюгу на Землю.",
      },
    ],
  },
  {
    label: "Литература",
    events: [
      {
        date: "1997",
        description:
          "Опубликована первая книга из серии «Гарри Поттер» Джоан Роулинг.",
      },
      {
        date: "2000",
        description:
          "Габриэль Гарсиа Маркес публикует роман «Вспоминая моих грустных шлюх».",
      },
      {
        date: "2013",
        description:
          "Элис Манро стала лауреатом Нобелевской премии по литературе.",
      },
      {
        date: "2015",
        description: "Опубликован роман Харпера Ли «Пойди поставь сторожа».",
      },
      {
        date: "2021",
        description: "Луиза Глюк получила Нобелевскую премию за поэзию.",
      },
      {
        date: "2023",
        description:
          "Журналистка Анни Эрно получила Нобелевскую премию по литературе.",
      },
    ],
  },
  {
    label: "Кино",
    events: [
      {
        date: "1977",
        description: "Выход фильма «Звёздные войны: Новая надежда».",
      },
      {
        date: "1994",
        description: "Премьера культового фильма «Криминальное чтиво».",
      },
      {
        date: "2009",
        description:
          "Выход фильма «Аватар», ставшего самым кассовым фильмом в истории.",
      },
      {
        date: "2019",
        description:
          "Фильм «Мстители: Финал» стал вторым по кассовым сборам в истории.",
      },
      {
        date: "2022",
        description:
          "Выход фильма «Все везде и сразу», получившего премию «Оскар».",
      },
      {
        date: "2023",
        description: "Фильм «Оппенгеймер» Кристофера Нолана стал хитом года.",
      },
    ],
  },
  {
    label: "Театр",
    events: [
      {
        date: "1948",
        description: "Создан Международный театральный институт ЮНЕСКО.",
      },
      {
        date: "1964",
        description: "Премьера мюзикла «Скрипач на крыше» на Бродвее.",
      },
      {
        date: "1986",
        description: "Премьера мюзикла «Призрак Оперы» в Лондоне.",
      },
      {
        date: "2015",
        description:
          "В Лондоне состоялась постановка пьесы «Гарри Поттер и проклятое дитя».",
      },
      {
        date: "2020",
        description: "Театры по всему миру закрылись из-за пандемии COVID-19.",
      },
      {
        date: "2023",
        description: "«Король Лев» стал самым прибыльным мюзиклом в истории.",
      },
    ],
  },
  {
    label: "Игры",
    events: [
      {
        date: "1985",
        description: "Выпущена игра «Супер Марио Братья».",
      },
      {
        date: "1996",
        description: "Запуск первой игры из серии Pokémon.",
      },
      {
        date: "2004",
        description: "Релиз игры World of Warcraft.",
      },
      {
        date: "2011",
        description: "Выпущена игра Minecraft, ставшая культурным феноменом.",
      },
      {
        date: "2017",
        description:
          "Запуск игры Fortnite, завоевавшей популярность во всём мире.",
      },
      {
        date: "2022",
        description: "Выход игры Elden Ring, получившей множество наград.",
      },
    ],
  },
  {
    label: "Космос",
    events: [
      {
        date: "1961",
        description: "Первый полёт человека в космос (Юрий Гагарин).",
      },
      {
        date: "1969",
        description: "Первая высадка человека на Луну (миссия Аполлон-11).",
      },
      {
        date: "1990",
        description: "Запуск космического телескопа «Хаббл».",
      },
      {
        date: "2004",
        description: "Первый частный космический полёт (SpaceShipOne).",
      },
      {
        date: "2021",
        description:
          "Ракета SpaceX доставила первого полностью гражданского экипажа на орбиту.",
      },
      {
        date: "2023",
        description:
          "Индия впервые осуществила посадку аппарата на южном полюсе Луны.",
      },
    ],
  },
];
